       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCSTATUS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACC-STATUS     PIC X.
          88 ACTIVE      VALUE 'A'.
          88 INACTIVE    VALUE 'I'.

       PROCEDURE DIVISION.
           DISPLAY "ENTER ACCOUNT STATUS (A/I): "
           ACCEPT ACC-STATUS

           IF ACTIVE
               DISPLAY "ACCOUNT ACTIVE"
           ELSE
               DISPLAY "ACCOUNT INACTIVE"
           END-IF

           STOP RUN.
