       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRANSACTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BALANCE        PIC 9(5).
       01 WITHDRAW-AMT   PIC 9(5).
       01 FINAL-BAL      PIC 9(5).

       PROCEDURE DIVISION.
           DISPLAY "ENTER CURRENT BALANCE: "
           ACCEPT BALANCE

           DISPLAY "ENTER WITHDRAW AMOUNT: "
           ACCEPT WITHDRAW-AMT

           IF WITHDRAW-AMT <= BALANCE
               COMPUTE FINAL-BAL = BALANCE - WITHDRAW-AMT
               DISPLAY "WITHDRAWAL SUCCESSFUL"
               DISPLAY "REMAINING BALANCE: " FINAL-BAL
           ELSE
               DISPLAY "INSUFFICIENT BALANCE"
           END-IF

           STOP RUN.
