       IDENTIFICATION DIVISION.
       PROGRAM-ID. CELSIUS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 C PIC 9(3)V9(2).
       01 F PIC 9(3)V9(2).

       PROCEDURE DIVISION.
           DISPLAY "Enter Celsius value: ".
           ACCEPT C.
           COMPUTE F = (C * 9 / 5) + 32.
           DISPLAY "Fahrenheit = " F.
           STOP RUN.
